predicates
able
abnormal
above-average
absent-minded
adaptable
adventurous
affable
affectionate
agile
agreeable
alert
amazing
ambitious
amiable
amicable
amusing
analytical
angelic
apathetic
apprehensive
ardent
artificial
artistic
assertive
attentive
attractive
average
awesome
awful
balanced
bald
balding
beautiful
beefy
below-average
beneficent
big-boned
bleached
blue
blunt
boisterous
brave
bright
brilliant
broad
broad-minded
buff
burly
callous
calm
candid
cantankerous
capable
careful
careless
caustic
cautious
charming
cheerful
chic
childish
childlike
chubby
churlish
circumspect
civil
clean
clean-shaven
clever
close-cropped
clumsy
coherent
cold
communicative
compassionate
competent
composed
conceited
condescending
confident
confused
conscientious
considerate
content
convivial
cool
cool-headed
cooperative
cordial
courageous
courteous
cowardly
crabby
crafty
cranky
crass
creative
critical
cruel
curious
curly
curvy
cute
cynical
dainty
decisive
deep
deferential
deft
delicate
delightful
demonic
demure
dependent
depressed
determined
devoted
dexterous
diligent
diplomatic
direct
dirty
disagreeable
discerning
discreet
disruptive
distant
distraught
distrustful
dowdy
dramatic
dreaded
dreary
drowsy
drugged
drunk
dull
dutiful
dyed
dynamic
eager
earnest
easygoing
efficient
egotistical
elderly
elfin
emotional
energetic
enterprising
enthusiastic
evasive
even-tempered
exacting
excellent
excitable
experienced
exuberant
fabulous
fair-minded
faithful
fastidious
fearless
ferocious
fervent
fiery
flabby
flaky
flashy
forceful
frank
friendly
funny
fussy
gangly
gelled
generous
gentle
ginger
gloomy
gluttonous
good
good-looking
gorgeous
greasy
great
gregarious
greying
groggy
grouchy
guarded
hairy
handsome
hardworking
hateful
hearty
helpful
hesitant
honest
hot
hot-headed
humorous
hypercritical
hysterical
idiotic
idle
illogical
imaginative
immature
immodest
impartial
impatient
imperturbable
impetuous
impractical
impressionable
impressive
impulsive
inactive
incisive
incompetent
inconsiderate
inconsistent
indefatigable
independent
indiscreet
indolent
industrious
inexperienced
insensitive
inspiring
intellectual
intelligent
interesting
intolerant
intuitive
inventive
irascible
irritable
irritating
jocular
jovial
joyous
judgmental
keen
kind
lame
lanky
lazy
lean
leery
lethargic
level-headed
listless
lithe
lively
local
logical
long-winded
lovable
lovelorn
lovely
loving
loyal
maternal
mature
mean
meddlesome
mercurial
methodical
meticulous
middle-aged
mild
miserable
modest
moronic
morose
motivated
musical
naive
nasty
natural
naughty
neat
negative
nervous
nice
noisy
normal
nosy
numb
obese
obliging
obnoxious
old
old-fashioned
one-sided
optimistic
orderly
ostentatious
outgoing
outspoken
overweight
passionate
passive
paternal
paternalistic
patient
paunchy
peaceful
peevish
pensive
persevering
persistent
persnickety
petite
petulant
philosophical
picky
pierced
pigeon-toed
pioneering
placid
plain
plain-speaking
playful
pleasant
plucky
plump
podgy
polite
popular
positive
potbellied
powerful
practical
prejudiced
pretty
proactive
proficient
proud
provocative
prudent
punctual
quarrelsome
querulous
quick
quick-tempered
quick-witted
quiet
rational
realistic
reassuring
reclusive
reliable
reluctant
resentful
reserved
resigned
resourceful
respected
respectful
responsible
restless
revered
ridiculous
ripped
romantic
rough
sad
sassy
saucy
sedate
self-assured
self-confident
self-disciplined
selfish
sensible
sensitive
sentimental
serene
serious
sharp
shaved
shiny
short-tempered
shoulder-length
shrewd
shy
silly
sincere
skinny
sleepy
slender
slicked-back
slight
slim
sloppy
slothful
slovenly
slow
smart
snazzy
sneering
snobby
sober
sociable
somber
sophisticated
soulful
soulless
sour
spiky
spirited
spiteful
spotty
stable
staid
steady
stern
stocky
stoic
stooped
stout
straight
straightforward
striking
strong
stunning
stupid
sturdy
subtle
sulky
sullen
supercilious
superficial
surly
suspicious
sweet
sympathetic
tactful
tactless
talented
tattooed
testy
thinking
thirtyish
thoughtful
thoughtless
tidy
timid
tired
tolerant
touchy
tough
tranquil
ugly
unaffected
unassuming
unbalanced
uncertain
uncooperative
undependable
understanding
unemotional
unfriendly
unguarded
unhelpful
unimaginative
unmotivated
unpleasant
unpopular
unreliable
unsophisticated
unstable
unsure
unthinking
unwilling
venal
versatile
vigilant
volcanic
vulnerable
warm
warmhearted
wary
watchful
wavy
weak
well-behaved
well-built
well-developed
well-respected
well-rounded
willing
witty
wonderful
young
youngish
zealous